	

START:	   IN 10	// Αρχικοποίηση εισόδου/εξόδου

MAIN:		// Φορτώνουμε την τιμή του διακόπτη στον A
	   ANI 80	// Αναλύουμε το MSB του διακόπτη
	   JZ LEFT	// Αν είναι 0, μεταβαίνουμε στον κύκλο κίνησης προς τα αριστερά
	   JMP CHECK_LSB	// Αλλιώς, ελέγχουμε το LSB

LEFT:		// Φορτώνουμε την τιμή των LED στον A
	   RLC	// Αριστερή περιστροφή (κίνηση προς τα αριστερά)
	   STA 3000	// Αποθηκεύουμε τη νέα τιμή των LED
	   CALL DELAY	// Κάνουμε καθυστέρηση
	   JMP CHECK_LSB	// Ελέγχουμε το LSB και ανακαλούμε την κατάλληλη κίνηση

CHECK_LSB:		// Φορτώνουμε ξανά την τιμή του διακόπτη
	   ANI 01	// Αναλύουμε το LSB
	   JZ LEFT_STOP	// Αν είναι 0, σταματάμε την κίνηση προς τα αριστερά
	   JMP RIGHT	// Αλλιώς, συνεχίζουμε με την κίνηση προς τα δεξιά

LEFT_STOP:	   JMP MAIN	// Επανέρχεται στο κύριο βρόχο

RIGHT:		// Φορτώνουμε την τιμή των LED στον A
	   RRC	// Δεξιά περιστροφή (κίνηση προς τα δεξιά)
	   STA 3000	// Αποθηκεύουμε τη νέα τιμή των LED
	   CALL DELAY	// Κάνουμε καθυστέρηση
	   JMP CHECK_LSB	// Ελέγχουμε το LSB και ανακαλούμε την κατάλληλη κίνηση

DELAY:	   MVI B,0A	// Θέτουμε το B στην τιμή 10
	   MVI C,64	// Θέτουμε το C στην τιμή 100

LOOP:	   DCR C	// Μειώνουμε τον C
	   JNZ LOOP	// Εάν δεν είναι μηδέν, επαναλαμβάνουμε τον βρόχο
	   DCR B	// Μειώνουμε τον B
	   JNZ LOOP	// Εάν δεν είναι μηδέν, επαναλαμβάνουμε τον βρόχο
	   RET	// Επιστρέφουμε

END:	   JMP END	// Άπειρος βρόχος για να σταματήσει η εκτέλεση
